Revit 2027 API
FailuresAccessor.GetSeverity Method
 Provides access to the current failure severity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureSeverity GetSeverity()
Public Function GetSeverity As FailureSeverity
public:
FailureSeverity GetSeverity()
member GetSeverity : unit -> FailureSeverity
Return Value
FailureSeverity
 The highest severity of a failure message currently posted in the document.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace